# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

# Import pandas, numpy, matplotlib and seaborn

In [1]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

# 1. Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [2]:
data = np.array([1.0, 1.5, 3.0, 4.3, 8.2])
S = pd.Series(data)
print(S)

0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

In [16]:
#Show all keys (range)
print(S.keys())

#Get Index for a specific value
S[S == 4.3].index[0]

3

In [17]:
#access a cell
print(S[3])
first = S.get(3)
print(first)

4.3
4.3

# 2. Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [107]:
d = { 'a':[2, 3, 4, 5, 6], 'b':[3, 1, 9, 12, 2], 'c':[5., 1.4, 1.2, 0.8, 2.3], 
     'd': ['horse', 'cat', 'dog', 'tortoise', 'rabbit'], 'e':[13, 11, '', '', 9 ]}
index = [1, 2, 3, 4, 5]
df = pd.DataFrame(data=d, index = index)
df

   a   b    c         d   e
1  2   3  5.0     horse  13
2  3   1  1.4       cat  11
3  4   9  1.2       dog
4  5  12  0.8  tortoise
5  6   2  2.3    rabbit   9

In [77]:
d = { 'a':[2, 3, 4, 5, 6], 'b':[3, 1, 9, 12, 2], 'c':[5., 1.4, 1.2, 0.8, 2.3], 
     'd': ['horse', 'cat', 'dog', 'tortoise', 'rabbit'],'index':[1,2,3,4,5], 'e':[13, 11, '', '', 9 ]}
df = pd.DataFrame(data=d)
df = df.set_index('index')
df

       a   b    c         d   e
index
1      2   3  5.0     horse  13
2      3   1  1.4       cat  11
3      4   9  1.2       dog
4      5  12  0.8  tortoise
5      6   2  2.3    rabbit   9

In [95]:
#access the values of each row individually
for i in range(len(df)):
    print(df[i:i+1])
    print('----------------------')

   a  b    c      d   e
1  2  3  5.0  horse  13
----------------------
   a  b    c    d   e
2  3  1  1.4  cat  11
----------------------
   a  b    c    d e
3  4  9  1.2  dog
----------------------
   a   b    c         d e
4  5  12  0.8  tortoise
----------------------
   a  b    c       d  e
5  6  2  2.3  rabbit  9
----------------------

In [97]:
#access single cells
df['d'][4]

'tortoise'

In [102]:
#print the index and column names
columns = list(df.columns.values)
print('Column names: {}'.format(columns))

indices= list(df.index.values)
print('Index names: {}'.format(indices))

column names: ['a', 'b', 'c', 'd', 'e']
index names: [1, 2, 3, 4, 5]

In [104]:
#access values of each column individually
for i in columns:
    print(df[i])
    print('------------------')

1    2
2    3
3    4
4    5
5    6
Name: a, dtype: int64
------------------
1     3
2     1
3     9
4    12
5     2
Name: b, dtype: int64
------------------
1    5.0
2    1.4
3    1.2
4    0.8
5    2.3
Name: c, dtype: float64
------------------
1       horse
2         cat
3         dog
4    tortoise
5      rabbit
Name: d, dtype: object
------------------
1    13
2    11
3
4
5     9
Name: e, dtype: object
------------------

In [108]:
#rename columns
df = df.rename(columns={'a':'First', 'b': 'Second', 'c': 'Third', 'd': 'Animals', 'e': 'Optional'})
df

   First  Second  Third   Animals Optional
1      2       3    5.0     horse       13
2      3       1    1.4       cat       11
3      4       9    1.2       dog
4      5      12    0.8  tortoise
5      6       2    2.3    rabbit        9

In [113]:
#extract rows 2-4 as new dataframe
df3 = df[1:4]
df3

   First  Second  Third   Animals Optional
2      3       1    1.4       cat       11
3      4       9    1.2       dog
4      5      12    0.8  tortoise

In [112]:
#obtain summary table of dataframe
df.describe()

          First     Second     Third
count  5.000000   5.000000  5.000000
mean   4.000000   5.400000  2.140000
std    1.581139   4.827007  1.690562
min    2.000000   1.000000  0.800000
25%    3.000000   2.000000  1.200000
50%    4.000000   3.000000  1.400000
75%    5.000000   9.000000  2.300000
max    6.000000  12.000000  5.000000

# 3. Data Import

Import the following file into a dataframe _df2_:

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D

In [118]:
#df2 = pd.DataFrame.from_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D")
df2 = pd.DataFrame.from_csv('example_df.csv')
df2

    b    c         d     e
a
2   3  5.0     horse  13.0
3   1  1.4       cat  11.0
4   9  1.2       dog   NaN
5  12  0.8  tortoise   NaN
6   2  2.3    rabbit   9.0

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D

In [121]:
#df3 = pd.DataFrame.from_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D")

#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.from_csv.html

df3 = pd.DataFrame.from_csv('example_df2.csv', sep=';')
df3

    b    c         d     e
a
2   3  5.0     horse  13.0
3   1  1.4       cat  11.0
4   9  1.2       dog   NaN
5  12  0.8  tortoise   NaN
6   2  2.3    rabbit   9.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [128]:
#select rows containing values greater than 2 in the 3rd column
indices2= list(df2.index.values)
rowsGreaterTwo = []
for i in indices2:
    if df2['c'][i] > 2:
        rowsGreaterTwo.append(i)
        
print(rowsGreaterTwo)

[2, 6]

In [130]:
#select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
rowsGreaterTwoCat = []
for i in indices2:
    if df2['c'][i] > 2 or df2['d'][i] == 'cat':
        rowsGreaterTwoCat.append(i)
        
print(rowsGreaterTwoCat)

[2, 3, 6]

In [133]:
#drop rows with missing data
df2a = df2.dropna(axis=0)
df2a

   b    c       d     e
a
2  3  5.0   horse  13.0
3  1  1.4     cat  11.0
6  2  2.3  rabbit   9.0

In [140]:
#drop duplicate rows
df2a.drop_duplicates(keep='first')


#dfX = pd.DataFrame({"A":["foo", "foo", "foo", "bar"], "B":[0,1,1,1], "C":["A","A","B","A"]})
#print(dfX)
#dfX.drop_duplicates(subset=['A', 'C'], keep=False)

   b    c       d     e
a
2  3  5.0   horse  13.0
3  1  1.4     cat  11.0
6  2  2.3  rabbit   9.0

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [142]:
df2a.to_csv('data_export.txt', header=True, index=False, sep='\t')

# DataFrame aggregation

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.